_orgs/_posts/javascript/2015-10-15-apply-javascript.org
#+TITLE:     JavaScript 公共文件 
#+AUTHOR:    Rengui Zhao
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+BEGIN_EXPORT html
---
layout: post
title: JavaScript 公共文件
author: zrg
comments: false
description: JavaScript
categories:
- javascript
tags:
- JavaScript
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* Date/Time
*** 转换UTC时间
    #+BEGIN_SRC javascript
      function ConvertUtcTime(utctime, style) {
	  if (utctime == null || utctime == "") {
	      return "";
	  }else {
	      var d = utctime.substring(6, utctime.length - 1);
	      var newdate = new Date(parseInt(d));
	      if (style == null || style == "") style = "yyyy-MM-dd hh:mm:ss";
	      return newdate.format(style);
	  }
      }
    #+END_SRC
*** 将日期转换为yyyymmddhhssmm格式
    #+BEGIN_SRC js
      function getDate(date) {
	  var year = date.getFullYear();

	  var month = date.getMonth() + 1;
	  var date1 = date.getDate();
	  var day = date.getDay();

	  var hours = date.getHours();

	  var minutes = date.getMinutes();
	  var seconds = date.getSeconds();
	  var ms = date.getMilliseconds();
	  var curDateTime = year;
	  if (month > 9) {
	      curDateTime = curDateTime + month;
	  } else {
	      curDateTime = curDateTime + "0" + month;
	  }
	  if (day > 9) {
	      curDateTime = curDateTime + day;
	  } else {
	      curDateTime = curDateTime + "0" + day;
	  }
	  if (hours > 9) {
	      curDateTime = curDateTime + "" + hours;
	  } else {
	      curDateTime = curDateTime + "0" + hours;
	  }
	  if (minutes > 9) {
	      curDateTime = curDateTime + minutes;
	  } else {
	      curDateTime = curDateTime + "0" + minutes;
	  }
	  if (seconds > 9) {
	      curDateTime = curDateTime + seconds;
	  } else {
	      curDateTime = curDateTime + "0" + seconds;
	  }
	  return curDateTime;
      }
    #+END_SRC
*** 格式化日期
    #+BEGIN_SRC javascript
      Date.prototype.format = function (format) {
	  var o =
	      {
		  "M+": this.getMonth() + 1, //month
		  "d+": this.getDate(),    //day
		  "h+": this.getHours(),   //hour
		  "m+": this.getMinutes(), //minute
		  "s+": this.getSeconds(), //second
		  "q+": Math.floor((this.getMonth() + 3) / 3),  //quarter
		  "S": this.getMilliseconds() //millisecond
	      }
	  if (/(y+)/.test(format))
	      format = format.replace(RegExp.$1, (this.getFullYear() + "").substr(4 - RegExp.$1.length));
	  for (var k in o)
	      if (new RegExp("(" + k + ")").test(format))
		  format = format.replace(RegExp.$1, RegExp.$1.length == 1 ? o[k] : ("00" + o[k]).substr(("" + o[k]).length));
	  return format;
      }
    #+END_SRC
*** 日期加减
    #+BEGIN_SRC javascript
      function DateAdd(dateObj, days) {
	  var tempDate = dateObj.valueOf();
	  tempDate = tempDate + days * 24 * 60 * 60 * 1000
	  tempDate = new Date(tempDate)
	  return tempDate;
      }
    #+END_SRC
