_posts/javascript/2015-10-15-apply-javascript.html
---
layout: post
title: JavaScript 公共文件
author: zrg
comments: false
description: JavaScript
categories:
- javascript
tags:
- JavaScript
photos:
---

<div id="outline-container-org5094588" class="outline-2">
<h2 id="org5094588"><span class="section-number-2">1</span> Date/Time</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdeeb7a5" class="outline-4">
<h4 id="orgdeeb7a5"><span class="section-number-4">1.0.1</span> 转换UTC时间</h4>
<div class="outline-text-4" id="text-1-0-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">ConvertUtcTime</span>(<span style="color: #FD971F;">utctime</span>, <span style="color: #FD971F;">style</span>) {
    <span style="color: #F92672;">if</span> (utctime == <span style="color: #AE81FF;">null</span> || utctime == <span style="color: #E6DB74;">""</span>) {
        <span style="color: #F92672;">return</span> <span style="color: #E6DB74;">""</span>;
    }<span style="color: #F92672;">else</span> {
        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">d</span> = utctime.substring(6, utctime.length - 1);
        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">newdate</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>(parseInt(d));
        <span style="color: #F92672;">if</span> (style == <span style="color: #AE81FF;">null</span> || style == <span style="color: #E6DB74;">""</span>) style = <span style="color: #E6DB74;">"yyyy-MM-dd hh:mm:ss"</span>;
        <span style="color: #F92672;">return</span> newdate.format(style);
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org91c584b" class="outline-4">
<h4 id="org91c584b"><span class="section-number-4">1.0.2</span> 将日期转换为yyyymmddhhssmm格式</h4>
<div class="outline-text-4" id="text-1-0-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getDate</span>(<span style="color: #FD971F;">date</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">year</span> = date.getFullYear();

    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">month</span> = date.getMonth() + 1;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">date1</span> = date.getDate();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">day</span> = date.getDay();

    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">hours</span> = date.getHours();

    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">minutes</span> = date.getMinutes();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">seconds</span> = date.getSeconds();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">ms</span> = date.getMilliseconds();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">curDateTime</span> = year;
    <span style="color: #F92672;">if</span> (month &gt; 9) {
        curDateTime = curDateTime + month;
    } <span style="color: #F92672;">else</span> {
        curDateTime = curDateTime + <span style="color: #E6DB74;">"0"</span> + month;
    }
    <span style="color: #F92672;">if</span> (day &gt; 9) {
        curDateTime = curDateTime + day;
    } <span style="color: #F92672;">else</span> {
        curDateTime = curDateTime + <span style="color: #E6DB74;">"0"</span> + day;
    }
    <span style="color: #F92672;">if</span> (hours &gt; 9) {
        curDateTime = curDateTime + <span style="color: #E6DB74;">""</span> + hours;
    } <span style="color: #F92672;">else</span> {
        curDateTime = curDateTime + <span style="color: #E6DB74;">"0"</span> + hours;
    }
    <span style="color: #F92672;">if</span> (minutes &gt; 9) {
        curDateTime = curDateTime + minutes;
    } <span style="color: #F92672;">else</span> {
        curDateTime = curDateTime + <span style="color: #E6DB74;">"0"</span> + minutes;
    }
    <span style="color: #F92672;">if</span> (seconds &gt; 9) {
        curDateTime = curDateTime + seconds;
    } <span style="color: #F92672;">else</span> {
        curDateTime = curDateTime + <span style="color: #E6DB74;">"0"</span> + seconds;
    }
    <span style="color: #F92672;">return</span> curDateTime;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaeb0b25" class="outline-4">
<h4 id="orgaeb0b25"><span class="section-number-4">1.0.3</span> 格式化日期</h4>
<div class="outline-text-4" id="text-1-0-3">
<div class="org-src-container">
<pre class="src src-javascript">Date.<span style="color: #AE81FF;">prototype</span>.format = <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">format</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">o</span> =
        {
            <span style="color: #E6DB74;">"M+"</span>: <span style="color: #AE81FF;">this</span>.getMonth() + 1, <span style="color: #75715E;">//</span><span style="color: #75715E;">month</span>
            <span style="color: #E6DB74;">"d+"</span>: <span style="color: #AE81FF;">this</span>.getDate(),    <span style="color: #75715E;">//</span><span style="color: #75715E;">day</span>
            <span style="color: #E6DB74;">"h+"</span>: <span style="color: #AE81FF;">this</span>.getHours(),   <span style="color: #75715E;">//</span><span style="color: #75715E;">hour</span>
            <span style="color: #E6DB74;">"m+"</span>: <span style="color: #AE81FF;">this</span>.getMinutes(), <span style="color: #75715E;">//</span><span style="color: #75715E;">minute</span>
            <span style="color: #E6DB74;">"s+"</span>: <span style="color: #AE81FF;">this</span>.getSeconds(), <span style="color: #75715E;">//</span><span style="color: #75715E;">second</span>
            <span style="color: #E6DB74;">"q+"</span>: Math.floor((<span style="color: #AE81FF;">this</span>.getMonth() + 3) / 3),  <span style="color: #75715E;">//</span><span style="color: #75715E;">quarter</span>
            <span style="color: #E6DB74;">"S"</span>: <span style="color: #AE81FF;">this</span>.getMilliseconds() <span style="color: #75715E;">//</span><span style="color: #75715E;">millisecond</span>
        }
    <span style="color: #F92672;">if</span> (<span style="color: #E6DB74;">/(y+)/</span>.test(format))
        format = format.replace(RegExp.$1, (<span style="color: #AE81FF;">this</span>.getFullYear() + <span style="color: #E6DB74;">""</span>).substr(4 - RegExp.$1.length));
    <span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">k</span> <span style="color: #F92672;">in</span> o)
        <span style="color: #F92672;">if</span> (<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">RegExp</span>(<span style="color: #E6DB74;">"("</span> + k + <span style="color: #E6DB74;">")"</span>).test(format))
            format = format.replace(RegExp.$1, RegExp.$1.length == 1 ? o[k] : (<span style="color: #E6DB74;">"00"</span> + o[k]).substr((<span style="color: #E6DB74;">""</span> + o[k]).length));
    <span style="color: #F92672;">return</span> format;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org048c304" class="outline-4">
<h4 id="org048c304"><span class="section-number-4">1.0.4</span> 日期加减</h4>
<div class="outline-text-4" id="text-1-0-4">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">DateAdd</span>(<span style="color: #FD971F;">dateObj</span>, <span style="color: #FD971F;">days</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">tempDate</span> = dateObj.valueOf();
    tempDate = tempDate + days * 24 * 60 * 60 * 1000
    tempDate = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>(tempDate)
    <span style="color: #F92672;">return</span> tempDate;
}
</pre>
</div>
</div>
</div>
