_orgs/_posts/javascript/2015-10-15-apply-javascript.org
*** 获取指定日期
    #+BEGIN_SRC javascript
      //获取指定日期开始时间（00：00：00）
      function getTodayStart(date) {
	  var y = date.getFullYear();
	  var m = date.getMonth() + 1;
	  var d = date.getDate();
	  var time = y + '-' + (m < 10 ? ('0' + m) : m) + '-' + (d < 10 ? ('0' + d) : d) + " 00:00:00";
	  return time;
      }

      //获取指定日期结束时间（00：00：00）
      function getTodayEnd(date) {
	  var y = date.getFullYear();
	  var m = date.getMonth() + 1;
	  var d = date.getDate();
	  var time = y + '-' + (m < 10 ? ('0' + m) : m) + '-' + (d < 10 ? ('0' + d) : d) + " 23:59:59";
	  return time;
      }

      //获取指定当月第一天日期
      function getMonthStart(date) {
	  var y = date.getFullYear();
	  var m = date.getMonth() + 1;
	  //var d = date.getDate();
	  var time = y + '-' + (m < 10 ? ('0' + m) : m) + '-' + 1;
	  return time;
      }

      //获取指定当天日期
      function getMonthEnd(date) {
	  var y = date.getFullYear();
	  var m = date.getMonth() + 1;
	  var d = date.getDate();
	  var time = y + '-' + (m < 10 ? ('0' + m) : m) + '-' + (d < 10 ? ('0' + d) : d);
	  return time;
      }

      //获取月份最后一天
      function getCurrentMonthLast(date) {
	  var currentMonth = date.getMonth();
	  var nextMonth = ++currentMonth;
	  var nextMonthFirstDay = new Date(date.getFullYear(), nextMonth, 1);
	  var oneDay = 1000 * 60 * 60 * 24;
	  return new Date(nextMonthFirstDay - oneDay);
      }
    #+END_SRC
*** 计算日期差
    #+BEGIN_SRC javascript
      function getDateDiff(date1, date2) {
	  var times = date2 - date1;
	  var days = Math.floor(times / (1000 * 60 * 60 * 24));
	  times = times - days * 1000 * 60 * 60 * 24;
	  var hours = Math.floor(times / (1000 * 60 * 60));
	  times = times - hours * 1000 * 60 * 60;
	  var minus = Math.floor(times / 60000);
	  times = times - minus * 60000;
	  var secs = Math.floor(times / 6000);

	  var ret = "";
	  if (days > 0) {
	      ret = days + "天" + hours + "时" + minus + "分" + secs + "秒";
	  }
	  else {
	      if (hours > 0) ret = hours + "时";
	      ret = ret + minus + "分" + secs + "秒";
	  }
	  return ret;
      }
    #+END_SRC
