_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-org3bff0bc" class="outline-4">
<h4 id="org3bff0bc"><span class="section-number-4">1.0.5</span> 获取指定日期</h4>
<div class="outline-text-4" id="text-1-0-5">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">//</span><span style="color: #75715E;">&#33719;&#21462;&#25351;&#23450;&#26085;&#26399;&#24320;&#22987;&#26102;&#38388;&#65288;00&#65306;00&#65306;00&#65289;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getTodayStart</span>(<span style="color: #FD971F;">date</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">y</span> = date.getFullYear();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">m</span> = date.getMonth() + 1;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">d</span> = date.getDate();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">time</span> = y + <span style="color: #E6DB74;">'-'</span> + (m &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + m) : m) + <span style="color: #E6DB74;">'-'</span> + (d &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + d) : d) + <span style="color: #E6DB74;">" 00:00:00"</span>;
    <span style="color: #F92672;">return</span> time;
}

<span style="color: #75715E;">//</span><span style="color: #75715E;">&#33719;&#21462;&#25351;&#23450;&#26085;&#26399;&#32467;&#26463;&#26102;&#38388;&#65288;00&#65306;00&#65306;00&#65289;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getTodayEnd</span>(<span style="color: #FD971F;">date</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">y</span> = date.getFullYear();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">m</span> = date.getMonth() + 1;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">d</span> = date.getDate();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">time</span> = y + <span style="color: #E6DB74;">'-'</span> + (m &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + m) : m) + <span style="color: #E6DB74;">'-'</span> + (d &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + d) : d) + <span style="color: #E6DB74;">" 23:59:59"</span>;
    <span style="color: #F92672;">return</span> time;
}

<span style="color: #75715E;">//</span><span style="color: #75715E;">&#33719;&#21462;&#25351;&#23450;&#24403;&#26376;&#31532;&#19968;&#22825;&#26085;&#26399;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getMonthStart</span>(<span style="color: #FD971F;">date</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">y</span> = date.getFullYear();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">m</span> = date.getMonth() + 1;
    <span style="color: #75715E;">//</span><span style="color: #75715E;">var d = date.getDate();</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">time</span> = y + <span style="color: #E6DB74;">'-'</span> + (m &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + m) : m) + <span style="color: #E6DB74;">'-'</span> + 1;
    <span style="color: #F92672;">return</span> time;
}

<span style="color: #75715E;">//</span><span style="color: #75715E;">&#33719;&#21462;&#25351;&#23450;&#24403;&#22825;&#26085;&#26399;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getMonthEnd</span>(<span style="color: #FD971F;">date</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">y</span> = date.getFullYear();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">m</span> = date.getMonth() + 1;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">d</span> = date.getDate();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">time</span> = y + <span style="color: #E6DB74;">'-'</span> + (m &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + m) : m) + <span style="color: #E6DB74;">'-'</span> + (d &lt; 10 ? (<span style="color: #E6DB74;">'0'</span> + d) : d);
    <span style="color: #F92672;">return</span> time;
}

<span style="color: #75715E;">//</span><span style="color: #75715E;">&#33719;&#21462;&#26376;&#20221;&#26368;&#21518;&#19968;&#22825;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getCurrentMonthLast</span>(<span style="color: #FD971F;">date</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">currentMonth</span> = date.getMonth();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">nextMonth</span> = ++currentMonth;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">nextMonthFirstDay</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>(date.getFullYear(), nextMonth, 1);
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">oneDay</span> = 1000 * 60 * 60 * 24;
    <span style="color: #F92672;">return</span> <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>(nextMonthFirstDay - oneDay);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9b14d3f" class="outline-4">
<h4 id="org9b14d3f"><span class="section-number-4">1.0.6</span> 计算日期差</h4>
<div class="outline-text-4" id="text-1-0-6">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getDateDiff</span>(<span style="color: #FD971F;">date1</span>, <span style="color: #FD971F;">date2</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">times</span> = date2 - date1;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">days</span> = Math.floor(times / (1000 * 60 * 60 * 24));
    times = times - days * 1000 * 60 * 60 * 24;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">hours</span> = Math.floor(times / (1000 * 60 * 60));
    times = times - hours * 1000 * 60 * 60;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">minus</span> = Math.floor(times / 60000);
    times = times - minus * 60000;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">secs</span> = Math.floor(times / 6000);

    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">ret</span> = <span style="color: #E6DB74;">""</span>;
    <span style="color: #F92672;">if</span> (days &gt; 0) {
        ret = days + <span style="color: #E6DB74;">"&#22825;"</span> + hours + <span style="color: #E6DB74;">"&#26102;"</span> + minus + <span style="color: #E6DB74;">"&#20998;"</span> + secs + <span style="color: #E6DB74;">"&#31186;"</span>;
    }
    <span style="color: #F92672;">else</span> {
        <span style="color: #F92672;">if</span> (hours &gt; 0) ret = hours + <span style="color: #E6DB74;">"&#26102;"</span>;
        ret = ret + minus + <span style="color: #E6DB74;">"&#20998;"</span> + secs + <span style="color: #E6DB74;">"&#31186;"</span>;
    }
    <span style="color: #F92672;">return</span> ret;
}
</pre>
</div>
</div>
</div>
