_orgs/_posts/javascript/2015-10-15-apply-javascript.org
*** 倒计时
    #+BEGIN_HTML emacs-lisp
    <strong>剩余时间：</strong><span id="timer"></span>
    #+END_HTML
    #+BEGIN_SRC javascript
      //倒计时 start
      var time_end,time_now_server,time_now_client,time_end,time_server_client,timerID;
      //截止时间
      time_end = new Date('{$appraisal_points.stop_time|date="Y-m-d H:i:s",###}');
      time_end=time_end.getTime();
      //当前时间
      time_now_server=new Date();
      time_now_server=time_now_server.getTime();
      time_now_client=new Date();
      time_now_client=time_now_client.getTime();
      time_server_client=time_now_server-time_now_client;
      setTimeout("show_time()",1000);
      //显示时间函数
      function show_time()
      {
	  Var timer = document.getElementById("timer");
	  if(!timer){
	      return ;
	  }
	  timer.innerHTML =time_server_client;

	  var time_now,time_distance,str_time;
	  var int_day,int_hour,int_minute,int_second;
	  var time_now=new Date();
	  time_now=time_now.getTime()+time_server_client;
	  time_distance=time_end-time_now;
	  if(time_distance>0)
	  {
	      int_day=Math.floor(time_distance/86400000);
	      time_distance-=int_day*86400000;
	      int_hour=Math.floor(time_distance/3600000);
	      time_distance-=int_hour*3600000;
	      int_minute=Math.floor(time_distance/60000);
	      time_distance-=int_minute*60000;
	      int_second=Math.floor(time_distance/1000);

	      if(int_hour<10){
		  int_hour="0"+int_hour;
	      }
	      if(int_minute<10){
		  int_minute="0"+int_minute;
	      }
	      if(int_second<10){
		  int_second="0"+int_second;
	      }
	      if (int_day>0) {
		  str_time="<b style='color:#46be8a;'>"+int_day+"</b style='color:#46be8a;'>天<b style='color:#46be8a;'>"+int_hour+"</b style='color:#46be8a;'>小时<b style='color:#46be8a;'>"+int_minute+"</b style='color:#46be8a;'>分钟<b style='color:#46be8a;'>"+int_second+"</b style='color:#46be8a;'>秒";
	      }else if(int_day == 0 && int_hour>=12){
		  str_time="<b style='color:#f5a751;'>"+int_day+"</b style='color:#f5a751;'>天<b style='color:#f5a751;'>"+int_hour+"</b style='color:#f5a751;'>小时<b style='color:#f5a751;'>"+int_minute+"</b style='color:#f5a751;'>分钟<b style='color:#f5a751;'>"+int_second+"</b style='color:#f5a751;'>秒";
	      }else if(int_day == 0 && int_hour<=5){
		  str_time="<b style='color:#fc6167;'>"+int_day+"</b style='color:#fc6167;'>天<b style='color:#fc6167;'>"+int_hour+"</b style='color:#fc6167;'>小时<b style='color:#fc6167;'>"+int_minute+"</b style='color:#fc6167;'>分钟<b style='color:#fc6167;'>"+int_second+"</b style='color:#fc6167;'>秒";
	      }
	      timer.innerHTML=str_time;
	      setTimeout("show_time()",1000);
	  }
	  else
	  {
	      timer.innerHTML =timer.innerHTML;
	      clearTimeout(timerID);
	      // window.location.href="http://www.baidu.com";
	  }
      }
      //倒计时 end
    #+END_SRC
*** 指定睡眠时间
    #+BEGIN_SRC javascript
      /**
       ,* js指定睡眠时长
       ,* @param  {[type]} numberMillis [description]
       ,* @return {[type]}              [description]
       ,*/
      function sleep(numberMillis) {
	  var now = new Date();
	  var exitTime = now.getTime() + numberMillis;
	  while (true) {
	      now = new Date();
	      if (now.getTime() > exitTime)
		  return;
	  }
      }
    #+END_SRC
* String
*** 生成随机验证码
    #+BEGIN_SRC javascript
      function CreateCode() {
	  var code = '';
	  var codeLength = 6;//验证码的长度
	  var selectChar = new Array('1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M', 'N', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z');

	  for (var i = 0; i < codeLength; i++) {
	      var charIndex = Math.floor(Math.random() * 32);
	      code += selectChar[charIndex];
	  }
	  return code;
      }
    #+END_SRC
