_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-orgfba8335" class="outline-4">
<h4 id="orgfba8335"><span class="section-number-4">1.0.7</span> 倒计时</h4>
<div class="outline-text-4" id="text-1-0-7">
<div class="HTML">
<p>
&lt;strong&gt;剩余时间：&lt;/strong&gt;&lt;span id="timer"&gt;&lt;/span&gt;
</p>

</div>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">//</span><span style="color: #75715E;">&#20498;&#35745;&#26102; start</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">time_end</span>,<span style="color: #FD971F;">time_now_server</span>,<span style="color: #FD971F;">time_now_client</span>,<span style="color: #FD971F;">time_end</span>,<span style="color: #FD971F;">time_server_client</span>,<span style="color: #FD971F;">timerID</span>;
<span style="color: #75715E;">//</span><span style="color: #75715E;">&#25130;&#27490;&#26102;&#38388;</span>
time_end = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>(<span style="color: #E6DB74;">'{$appraisal_points.stop_time|date="Y-m-d H:i:s",###}'</span>);
time_end=time_end.getTime();
<span style="color: #75715E;">//</span><span style="color: #75715E;">&#24403;&#21069;&#26102;&#38388;</span>
time_now_server=<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>();
time_now_server=time_now_server.getTime();
time_now_client=<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>();
time_now_client=time_now_client.getTime();
time_server_client=time_now_server-time_now_client;
setTimeout(<span style="color: #E6DB74;">"show_time()"</span>,1000);
<span style="color: #75715E;">//</span><span style="color: #75715E;">&#26174;&#31034;&#26102;&#38388;&#20989;&#25968;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">show_time</span>()
{
    Var timer = document.getElementById(<span style="color: #E6DB74;">"timer"</span>);
    <span style="color: #F92672;">if</span>(!timer){
        <span style="color: #F92672;">return</span> ;
    }
    timer.innerHTML =time_server_client;

    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">time_now</span>,<span style="color: #FD971F;">time_distance</span>,<span style="color: #FD971F;">str_time</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">int_day</span>,<span style="color: #FD971F;">int_hour</span>,<span style="color: #FD971F;">int_minute</span>,<span style="color: #FD971F;">int_second</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">time_now</span>=<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>();
    time_now=time_now.getTime()+time_server_client;
    time_distance=time_end-time_now;
    <span style="color: #F92672;">if</span>(time_distance&gt;0)
    {
        int_day=Math.floor(time_distance/86400000);
        time_distance-=int_day*86400000;
        int_hour=Math.floor(time_distance/3600000);
        time_distance-=int_hour*3600000;
        int_minute=Math.floor(time_distance/60000);
        time_distance-=int_minute*60000;
        int_second=Math.floor(time_distance/1000);

        <span style="color: #F92672;">if</span>(int_hour&lt;10){
            int_hour=<span style="color: #E6DB74;">"0"</span>+int_hour;
        }
        <span style="color: #F92672;">if</span>(int_minute&lt;10){
            int_minute=<span style="color: #E6DB74;">"0"</span>+int_minute;
        }
        <span style="color: #F92672;">if</span>(int_second&lt;10){
            int_second=<span style="color: #E6DB74;">"0"</span>+int_second;
        }
        <span style="color: #F92672;">if</span> (int_day&gt;0) {
            str_time=<span style="color: #E6DB74;">"&lt;b style='color:#46be8a;'&gt;"</span>+int_day+<span style="color: #E6DB74;">"&lt;/b style='color:#46be8a;'&gt;&#22825;&lt;b style='color:#46be8a;'&gt;"</span>+int_hour+<span style="color: #E6DB74;">"&lt;/b style='color:#46be8a;'&gt;&#23567;&#26102;&lt;b style='color:#46be8a;'&gt;"</span>+int_minute+<span style="color: #E6DB74;">"&lt;/b style='color:#46be8a;'&gt;&#20998;&#38047;&lt;b style='color:#46be8a;'&gt;"</span>+int_second+<span style="color: #E6DB74;">"&lt;/b style='color:#46be8a;'&gt;&#31186;"</span>;
        }<span style="color: #F92672;">else</span> <span style="color: #F92672;">if</span>(int_day == 0 &amp;&amp; int_hour&gt;=12){
            str_time=<span style="color: #E6DB74;">"&lt;b style='color:#f5a751;'&gt;"</span>+int_day+<span style="color: #E6DB74;">"&lt;/b style='color:#f5a751;'&gt;&#22825;&lt;b style='color:#f5a751;'&gt;"</span>+int_hour+<span style="color: #E6DB74;">"&lt;/b style='color:#f5a751;'&gt;&#23567;&#26102;&lt;b style='color:#f5a751;'&gt;"</span>+int_minute+<span style="color: #E6DB74;">"&lt;/b style='color:#f5a751;'&gt;&#20998;&#38047;&lt;b style='color:#f5a751;'&gt;"</span>+int_second+<span style="color: #E6DB74;">"&lt;/b style='color:#f5a751;'&gt;&#31186;"</span>;
        }<span style="color: #F92672;">else</span> <span style="color: #F92672;">if</span>(int_day == 0 &amp;&amp; int_hour&lt;=5){
            str_time=<span style="color: #E6DB74;">"&lt;b style='color:#fc6167;'&gt;"</span>+int_day+<span style="color: #E6DB74;">"&lt;/b style='color:#fc6167;'&gt;&#22825;&lt;b style='color:#fc6167;'&gt;"</span>+int_hour+<span style="color: #E6DB74;">"&lt;/b style='color:#fc6167;'&gt;&#23567;&#26102;&lt;b style='color:#fc6167;'&gt;"</span>+int_minute+<span style="color: #E6DB74;">"&lt;/b style='color:#fc6167;'&gt;&#20998;&#38047;&lt;b style='color:#fc6167;'&gt;"</span>+int_second+<span style="color: #E6DB74;">"&lt;/b style='color:#fc6167;'&gt;&#31186;"</span>;
        }
        timer.innerHTML=str_time;
        setTimeout(<span style="color: #E6DB74;">"show_time()"</span>,1000);
    }
    <span style="color: #F92672;">else</span>
    {
        timer.innerHTML =timer.innerHTML;
        clearTimeout(timerID);
        <span style="color: #75715E;">// </span><span style="color: #75715E;">window.location.href="http://www.baidu.com";</span>
    }
}
<span style="color: #75715E;">//</span><span style="color: #75715E;">&#20498;&#35745;&#26102; end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcec4626" class="outline-4">
<h4 id="orgcec4626"><span class="section-number-4">1.0.8</span> 指定睡眠时间</h4>
<div class="outline-text-4" id="text-1-0-8">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #E6DB74;">/**</span>
<span style="color: #E6DB74;"> * js&#25351;&#23450;&#30561;&#30496;&#26102;&#38271;</span>
<span style="color: #E6DB74;"> * @param  {[type]} numberMillis [description]</span>
<span style="color: #E6DB74;"> * @return {[type]}              [description]</span>
<span style="color: #E6DB74;"> */</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">sleep</span>(<span style="color: #FD971F;">numberMillis</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">now</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">exitTime</span> = now.getTime() + numberMillis;
    <span style="color: #F92672;">while</span> (<span style="color: #AE81FF;">true</span>) {
        now = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Date</span>();
        <span style="color: #F92672;">if</span> (now.getTime() &gt; exitTime)
            <span style="color: #F92672;">return</span>;
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga8a2b6c" class="outline-2">
<h2 id="orga8a2b6c"><span class="section-number-2">2</span> String</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org136c318" class="outline-4">
<h4 id="org136c318"><span class="section-number-4">2.0.1</span> 生成随机验证码</h4>
<div class="outline-text-4" id="text-2-0-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">CreateCode</span>() {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">code</span> = <span style="color: #E6DB74;">''</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">codeLength</span> = 6;<span style="color: #75715E;">//</span><span style="color: #75715E;">&#39564;&#35777;&#30721;&#30340;&#38271;&#24230;</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">selectChar</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Array</span>(<span style="color: #E6DB74;">'1'</span>, <span style="color: #E6DB74;">'2'</span>, <span style="color: #E6DB74;">'3'</span>, <span style="color: #E6DB74;">'4'</span>, <span style="color: #E6DB74;">'5'</span>, <span style="color: #E6DB74;">'6'</span>, <span style="color: #E6DB74;">'7'</span>, <span style="color: #E6DB74;">'8'</span>, <span style="color: #E6DB74;">'9'</span>, <span style="color: #E6DB74;">'A'</span>, <span style="color: #E6DB74;">'B'</span>, <span style="color: #E6DB74;">'C'</span>, <span style="color: #E6DB74;">'D'</span>, <span style="color: #E6DB74;">'E'</span>, <span style="color: #E6DB74;">'F'</span>, <span style="color: #E6DB74;">'G'</span>, <span style="color: #E6DB74;">'H'</span>, <span style="color: #E6DB74;">'J'</span>, <span style="color: #E6DB74;">'K'</span>, <span style="color: #E6DB74;">'L'</span>, <span style="color: #E6DB74;">'M'</span>, <span style="color: #E6DB74;">'N'</span>, <span style="color: #E6DB74;">'P'</span>, <span style="color: #E6DB74;">'Q'</span>, <span style="color: #E6DB74;">'R'</span>, <span style="color: #E6DB74;">'S'</span>, <span style="color: #E6DB74;">'T'</span>, <span style="color: #E6DB74;">'U'</span>, <span style="color: #E6DB74;">'V'</span>, <span style="color: #E6DB74;">'W'</span>, <span style="color: #E6DB74;">'X'</span>, <span style="color: #E6DB74;">'Y'</span>, <span style="color: #E6DB74;">'Z'</span>);

    <span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">i</span> = 0; i &lt; codeLength; i++) {
        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">charIndex</span> = Math.floor(Math.random() * 32);
        code += selectChar[charIndex];
    }
    <span style="color: #F92672;">return</span> code;
}
</pre>
</div>
</div>
</div>
