_orgs/_posts/javascript/2015-10-15-apply-javascript.org
*** 截取字符串包含中文处理
    #+BEGIN_SRC javascript
      //(串,长度,增加...) 
      function subString(str, len, hasDot) {
	  var newLength = 0;
	  var newStr = "";
	  var chineseRegex = /[^\x00-\xff]/g;
	  var singleChar = "";
	  var strLength = str.replace(chineseRegex, "**").length;
	  for (var i = 0; i < strLength; i++) {
	      singleChar = str.charAt(i).toString();
	      if (singleChar.match(chineseRegex) != null) {
		  newLength += 2;
	      }
	      else {
		  newLength++;
	      }
	      if (newLength > len) {
		  break;
	      }
	      newStr += singleChar;
	  }

	  if (hasDot && strLength > len) {
	      newStr += "...";
	  }
	  return newStr;
      }
    #+END_SRC
*** 获取 url 参数
    #+BEGIN_SRC js
      function GetRequest() {
	  var url = location.search; //获取url中"?"符后的字串
	  var theRequest = new Object();
	  if (url.indexOf("?") != -1) {
	      var str = url.substr(1);
	      strs = str.split("&");
	      for (var i = 0; i < strs.length; i++) {
		  theRequest[strs[i].split("=")[0]] = unescape(strs[i].split("=")[1]);
	      }
	  }
	  return theRequest;
      }
    #+END_SRC
*** 数字显示千分位
    #+BEGIN_SRC javascript
      // 数字转换为千分位显示
      function numberToThousands(number){
	  var reg = /\d{1,3}(?=(\d{3})+$)/g;
	  return number.toString().replace(reg, function(str){
	      return str + ',';
	  });
      }
      // 千分位转换为数字
      function thousandsToNumber(numberThousand){
	  return parseInt(numberThousand.toString().split(',').join(''));
      }
    #+END_SRC
** 常用内置函数
   #+BEGIN_SRC javascript
     concat(str1,str2)，字符串拼接
     left(str, length)，
     right(str, length)，
     substring(str, pos, length[optional])，pos：从第几位开始截取
     mid()，
     substr()，
     substring_index(str, delim, count)，delim：关键字，count：关键字出现的次数
   #+END_SRC
* Math/Number
*** 默认返回 0 ~ 1 之间的随机数
    #+BEGIN_SRC javascript
      // 取得介于 1 到 10 之间的一个随机数：
      Math.floor((Math.random()*10)+1);
      // 返回 min（包含）～ max（包含）之间的数字：
      function getRndInteger(min, max) {
	  return Math.floor(Math.random() * (max - min + 1) ) + min;
      }
    #+END_SRC
*** 直接取整(不考虑小数点后的部分)
    #+BEGIN_SRC javascript
      // 方式一: parseInt()
      var n = parseInt("3.14"); //3
      var n = parseInt("-3.14"); //-3
      var n = parseInt("2019hello"); //2019
      var n = parseInt(""); //NaN
      var n = parseInt("0xA"); //10(十六进制)
      var n = parseInt("070"); //56(八进制)
      // 方式二: 位运算
      var n = ~~3.14 //3
      var n = 3.14^0 //3
      var n = 3.14<<0 //3
    #+END_SRC
*** 计算后取整(四舍五入,向上取整,向下取整)
    #+BEGIN_SRC javascript
      // 四舍五入
      var n = Math.round(3.14); //3
      var n = Math.ceil(8.54); //9
      // 向上取整
      var n = Math.ceil(3.14); //4
      // 向下取整
      var n = Math.ceil(3.14); //3
    #+END_SRC
* Array
*** 判断某元素是否存在数组中
    #+BEGIN_SRC javascript
    var arr = ['a,','b','c','d','e'];
    if(arr.indexOf('a') >= 0) // indexOf 如果元素存在于数组中，会返回数组下标，否则返回 -1
    if($.inArray('a',arr) >=0) // 使用 jQuery 的 inArray 方法，与 indexOf 一样，如果元素存在于数组中，会返回数组下标，否则返回 -1
    #+END_SRC
* Object
