_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-org25f4e15" class="outline-4">
<h4 id="org25f4e15"><span class="section-number-4">2.0.2</span> 截取字符串包含中文处理</h4>
<div class="outline-text-4" id="text-2-0-2">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">//</span><span style="color: #75715E;">(&#20018;,&#38271;&#24230;,&#22686;&#21152;...) </span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">subString</span>(<span style="color: #FD971F;">str</span>, <span style="color: #FD971F;">len</span>, <span style="color: #FD971F;">hasDot</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">newLength</span> = 0;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">newStr</span> = <span style="color: #E6DB74;">""</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">chineseRegex</span> = <span style="color: #E6DB74;">/[^\x00-\xff]/</span>g;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">singleChar</span> = <span style="color: #E6DB74;">""</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">strLength</span> = str.replace(chineseRegex, <span style="color: #E6DB74;">"**"</span>).length;
    <span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">i</span> = 0; i &lt; strLength; i++) {
        singleChar = str.charAt(i).toString();
        <span style="color: #F92672;">if</span> (singleChar.match(chineseRegex) != <span style="color: #AE81FF;">null</span>) {
            newLength += 2;
        }
        <span style="color: #F92672;">else</span> {
            newLength++;
        }
        <span style="color: #F92672;">if</span> (newLength &gt; len) {
            <span style="color: #F92672;">break</span>;
        }
        newStr += singleChar;
    }

    <span style="color: #F92672;">if</span> (hasDot &amp;&amp; strLength &gt; len) {
        newStr += <span style="color: #E6DB74;">"..."</span>;
    }
    <span style="color: #F92672;">return</span> newStr;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org241fbb5" class="outline-4">
<h4 id="org241fbb5"><span class="section-number-4">2.0.3</span> 获取 url 参数</h4>
<div class="outline-text-4" id="text-2-0-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">GetRequest</span>() {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">url</span> = location.search; <span style="color: #75715E;">//</span><span style="color: #75715E;">&#33719;&#21462;url&#20013;"?"&#31526;&#21518;&#30340;&#23383;&#20018;</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">theRequest</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Object</span>();
    <span style="color: #F92672;">if</span> (url.indexOf(<span style="color: #E6DB74;">"?"</span>) != -1) {
        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">str</span> = url.substr(1);
        strs = str.split(<span style="color: #E6DB74;">"&amp;"</span>);
        <span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">i</span> = 0; i &lt; strs.length; i++) {
            theRequest[strs[i].split(<span style="color: #E6DB74;">"="</span>)[0]] = unescape(strs[i].split(<span style="color: #E6DB74;">"="</span>)[1]);
        }
    }
    <span style="color: #F92672;">return</span> theRequest;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org74adc6d" class="outline-4">
<h4 id="org74adc6d"><span class="section-number-4">2.0.4</span> 数字显示千分位</h4>
<div class="outline-text-4" id="text-2-0-4">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">// </span><span style="color: #75715E;">&#25968;&#23383;&#36716;&#25442;&#20026;&#21315;&#20998;&#20301;&#26174;&#31034;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">numberToThousands</span>(<span style="color: #FD971F;">number</span>){
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">reg</span> = <span style="color: #E6DB74;">/\d{1,3}(?=(\d{3})+$)/</span>g;
    <span style="color: #F92672;">return</span> number.toString().replace(reg, <span style="color: #F92672;">function</span>(<span style="color: #FD971F;">str</span>){
        <span style="color: #F92672;">return</span> str + <span style="color: #E6DB74;">','</span>;
    });
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#21315;&#20998;&#20301;&#36716;&#25442;&#20026;&#25968;&#23383;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">thousandsToNumber</span>(<span style="color: #FD971F;">numberThousand</span>){
    <span style="color: #F92672;">return</span> parseInt(numberThousand.toString().split(<span style="color: #E6DB74;">','</span>).join(<span style="color: #E6DB74;">''</span>));
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab2c5cc" class="outline-3">
<h3 id="orgab2c5cc"><span class="section-number-3">2.1</span> 常用内置函数</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-javascript">concat(str1,str2)&#65292;&#23383;&#31526;&#20018;&#25340;&#25509;
left(str, length)&#65292;
right(str, length)&#65292;
substring(str, pos, length[optional])&#65292;pos&#65306;&#20174;&#31532;&#20960;&#20301;&#24320;&#22987;&#25130;&#21462;
mid()&#65292;
substr()&#65292;
substring_index(str, delim, count)&#65292;delim&#65306;&#20851;&#38190;&#23383;&#65292;count&#65306;&#20851;&#38190;&#23383;&#20986;&#29616;&#30340;&#27425;&#25968;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4391a7c" class="outline-2">
<h2 id="org4391a7c"><span class="section-number-2">3</span> Math/Number</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgaa12de8" class="outline-4">
<h4 id="orgaa12de8"><span class="section-number-4">3.0.1</span> 默认返回 0 ~ 1 之间的随机数</h4>
<div class="outline-text-4" id="text-3-0-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">// </span><span style="color: #75715E;">&#21462;&#24471;&#20171;&#20110; 1 &#21040; 10 &#20043;&#38388;&#30340;&#19968;&#20010;&#38543;&#26426;&#25968;&#65306;</span>
Math.floor((Math.random()*10)+1);
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#36820;&#22238; min&#65288;&#21253;&#21547;&#65289;&#65374; max&#65288;&#21253;&#21547;&#65289;&#20043;&#38388;&#30340;&#25968;&#23383;&#65306;</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getRndInteger</span>(<span style="color: #FD971F;">min</span>, <span style="color: #FD971F;">max</span>) {
    <span style="color: #F92672;">return</span> Math.floor(Math.random() * (max - min + 1) ) + min;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ee6160" class="outline-4">
<h4 id="org2ee6160"><span class="section-number-4">3.0.2</span> 直接取整(不考虑小数点后的部分)</h4>
<div class="outline-text-4" id="text-3-0-2">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">// </span><span style="color: #75715E;">&#26041;&#24335;&#19968;: parseInt()</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = parseInt(<span style="color: #E6DB74;">"3.14"</span>); <span style="color: #75715E;">//</span><span style="color: #75715E;">3</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = parseInt(<span style="color: #E6DB74;">"-3.14"</span>); <span style="color: #75715E;">//</span><span style="color: #75715E;">-3</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = parseInt(<span style="color: #E6DB74;">"2019hello"</span>); <span style="color: #75715E;">//</span><span style="color: #75715E;">2019</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = parseInt(<span style="color: #E6DB74;">""</span>); <span style="color: #75715E;">//</span><span style="color: #75715E;">NaN</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = parseInt(<span style="color: #E6DB74;">"0xA"</span>); <span style="color: #75715E;">//</span><span style="color: #75715E;">10(&#21313;&#20845;&#36827;&#21046;)</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = parseInt(<span style="color: #E6DB74;">"070"</span>); <span style="color: #75715E;">//</span><span style="color: #75715E;">56(&#20843;&#36827;&#21046;)</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#26041;&#24335;&#20108;: &#20301;&#36816;&#31639;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = ~~3.14 <span style="color: #75715E;">//</span><span style="color: #75715E;">3</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = 3.14^0 <span style="color: #75715E;">//</span><span style="color: #75715E;">3</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = 3.14&lt;&lt;0 <span style="color: #75715E;">//</span><span style="color: #75715E;">3</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f1a2ca" class="outline-4">
<h4 id="org7f1a2ca"><span class="section-number-4">3.0.3</span> 计算后取整(四舍五入,向上取整,向下取整)</h4>
<div class="outline-text-4" id="text-3-0-3">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">// </span><span style="color: #75715E;">&#22235;&#33293;&#20116;&#20837;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = Math.round(3.14); <span style="color: #75715E;">//</span><span style="color: #75715E;">3</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = Math.ceil(8.54); <span style="color: #75715E;">//</span><span style="color: #75715E;">9</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#21521;&#19978;&#21462;&#25972;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = Math.ceil(3.14); <span style="color: #75715E;">//</span><span style="color: #75715E;">4</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#21521;&#19979;&#21462;&#25972;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">n</span> = Math.ceil(3.14); <span style="color: #75715E;">//</span><span style="color: #75715E;">3</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7635c2b" class="outline-2">
<h2 id="org7635c2b"><span class="section-number-2">4</span> Array</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd513fe1" class="outline-4">
<h4 id="orgd513fe1"><span class="section-number-4">4.0.1</span> 判断某元素是否存在数组中</h4>
<div class="outline-text-4" id="text-4-0-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">arr</span> = [<span style="color: #E6DB74;">'a,'</span>,<span style="color: #E6DB74;">'b'</span>,<span style="color: #E6DB74;">'c'</span>,<span style="color: #E6DB74;">'d'</span>,<span style="color: #E6DB74;">'e'</span>];
<span style="color: #F92672;">if</span>(arr.indexOf(<span style="color: #E6DB74;">'a'</span>) &gt;= 0) <span style="color: #75715E;">// </span><span style="color: #75715E;">indexOf &#22914;&#26524;&#20803;&#32032;&#23384;&#22312;&#20110;&#25968;&#32452;&#20013;&#65292;&#20250;&#36820;&#22238;&#25968;&#32452;&#19979;&#26631;&#65292;&#21542;&#21017;&#36820;&#22238; -1</span>
<span style="color: #F92672;">if</span>($.inArray(<span style="color: #E6DB74;">'a'</span>,arr) &gt;=0) <span style="color: #75715E;">// </span><span style="color: #75715E;">&#20351;&#29992; jQuery &#30340; inArray &#26041;&#27861;&#65292;&#19982; indexOf &#19968;&#26679;&#65292;&#22914;&#26524;&#20803;&#32032;&#23384;&#22312;&#20110;&#25968;&#32452;&#20013;&#65292;&#20250;&#36820;&#22238;&#25968;&#32452;&#19979;&#26631;&#65292;&#21542;&#21017;&#36820;&#22238; -1</span>
</pre>
</div>
</div>
</div>
</div>
