_orgs/_posts/javascript/2015-10-15-apply-javascript.org
*** 对象(Object) ⇋ 字符串(String)
    #+BEGIN_SRC javascript
// Object to String
var str=JSON.stringify(obj);
// JSON String to Object
var obj = JSON.parse(str);
    #+END_SRC
*** 判断对象/数组中key是否存在
    #+BEGIN_SRC javascript
if(obj.hasOwnProperty(key)){...}
    #+END_SRC
*** 数组对象遍历操作
    1. 使用 Object.keys(obj) 遍历
       #+BEGIN_SRC javascript
       var obj = {'0':'a','1':'b','2':'c'};
       Object.keys(obj).forEach(function(key){
       console.log(key,obj[key]);
       });
       // 注意： forEach不支持以下2种方式跳出循环，
       // 1) break; 执行报错: Uncaught SyntaxError: Illegal break statement
       // 2) return false; 只能跳出当前遍历执行
       
       // 返回指定格式数组
       var obj = {"1":5,"2":7,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0};
       var result = Object.keys(obj).map(function(key) {
       return [Number(key), obj[key]];
       });
       console.log(result);
       // [[1,5],[2,7],[3,0],[4,0]…].
       
       // 缺失需要跳出循环，使用 try…catch…
       var obj = {'0':'a','1':'b','2':'c'};
       try {
       Object.keys(obj).forEach(function(key){
       if(key == 'a'){
       console.log(key,obj[key]);
       throw new Error('exist');
       }
       });
       } catch (ex) {
       if(ex.message=='exist') throw ex
       } finally { 
       console.log('done');
       }
       #+END_SRC
    2. for-in
       #+BEGIN_SRC javascript
	 var obj = {'0':'a','1':'b','2':'c'};
	 for(var i in obj) {
	     console.log(i,":",obj[i]);
	 }
       #+END_SRC
    3. for-of
       #+BEGIN_SRC javascript
	 // 支持数组遍历、大多数类数组对象、字符串（视为一系列的Unicode字符来进行遍历）
	 var arr=["张三","李四","王五","赵六"];
	 for (var value of arr){
	     console.log(value);
	 }
       #+END_SRC
    4. 使用Object.getOwnPropertyNames(obj) 遍历
       #+BEGIN_SRC javascript
	 var obj = {'0':'a','1':'b','2':'c'};
	 Object.getOwnPropertyNames(obj).forEach(function(key){
	     console.log(key,obj[key]);
	 });
       #+END_SRC
    5. 使用Reflect.ownKeys(obj) 遍历
       #+BEGIN_SRC javascript
	 var obj = {'0':'a','1':'b','2':'c'};
	 Reflect.ownKeys(obj).forEach(function(key){
	     console.log(key,obj[key]);
	 });
       #+END_SRC
* 校验
** 检查对象是否为空对象
   #+BEGIN_SRC js
/* 
 * 检测对象是否是空对象(不包含任何可读属性)。 //如你上面的那个对象就是不含任何可读属性
 * 方法只既检测对象本身的属性，不检测从原型继承的属性。 
 */
function isOwnEmpty(obj) {
    for (var name in obj) {
        if (obj.hasOwnProperty(name)) {
            return false;
        }
    }
    return true;
}
/* 
 * 检测对象是否是空对象(不包含任何可读属性)。 
 * 方法既检测对象本身的属性，也检测从原型继承的属性(因此没有使hasOwnProperty)。 
 */
function isEmpty(obj) {
    for (var name in obj) {
        return false;
    }
    return true;
}
   #+END_SRC
