_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-org6dc72da" class="outline-2">
<h2 id="org6dc72da"><span class="section-number-2">5</span> Object</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4ff4036" class="outline-4">
<h4 id="org4ff4036"><span class="section-number-4">5.0.1</span> 对象(Object) ⇋ 字符串(String)</h4>
<div class="outline-text-4" id="text-5-0-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">// </span><span style="color: #75715E;">Object to String</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">str</span>=JSON.stringify(obj);
<span style="color: #75715E;">// </span><span style="color: #75715E;">JSON String to Object</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = JSON.parse(str);
</pre>
</div>
</div>
</div>
<div id="outline-container-org529f3f4" class="outline-4">
<h4 id="org529f3f4"><span class="section-number-4">5.0.2</span> 判断对象/数组中key是否存在</h4>
<div class="outline-text-4" id="text-5-0-2">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">if</span>(obj.hasOwnProperty(key)){...}
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f9afe1" class="outline-4">
<h4 id="org7f9afe1"><span class="section-number-4">5.0.3</span> 数组对象遍历操作</h4>
<div class="outline-text-4" id="text-5-0-3">
<ol class="org-ol">
<li><p>
使用 Object.keys(obj) 遍历
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = {<span style="color: #E6DB74;">'0'</span>:<span style="color: #E6DB74;">'a'</span>,<span style="color: #E6DB74;">'1'</span>:<span style="color: #E6DB74;">'b'</span>,<span style="color: #E6DB74;">'2'</span>:<span style="color: #E6DB74;">'c'</span>};
Object.keys(obj).forEach(<span style="color: #F92672;">function</span>(<span style="color: #FD971F;">key</span>){
console.log(key,obj[key]);
});
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#27880;&#24847;&#65306; forEach&#19981;&#25903;&#25345;&#20197;&#19979;2&#31181;&#26041;&#24335;&#36339;&#20986;&#24490;&#29615;&#65292;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">1) break; &#25191;&#34892;&#25253;&#38169;: Uncaught SyntaxError: Illegal break statement</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">2) return false; &#21482;&#33021;&#36339;&#20986;&#24403;&#21069;&#36941;&#21382;&#25191;&#34892;</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#36820;&#22238;&#25351;&#23450;&#26684;&#24335;&#25968;&#32452;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = {<span style="color: #E6DB74;">"1"</span>:5,<span style="color: #E6DB74;">"2"</span>:7,<span style="color: #E6DB74;">"3"</span>:0,<span style="color: #E6DB74;">"4"</span>:0,<span style="color: #E6DB74;">"5"</span>:0,<span style="color: #E6DB74;">"6"</span>:0,<span style="color: #E6DB74;">"7"</span>:0,<span style="color: #E6DB74;">"8"</span>:0};
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">result</span> = Object.keys(obj).map(<span style="color: #F92672;">function</span>(<span style="color: #FD971F;">key</span>) {
<span style="color: #F92672;">return</span> [Number(key), obj[key]];
});
console.log(result);
<span style="color: #75715E;">// </span><span style="color: #75715E;">[[1,5],[2,7],[3,0],[4,0]&#8230;].</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#32570;&#22833;&#38656;&#35201;&#36339;&#20986;&#24490;&#29615;&#65292;&#20351;&#29992; try&#8230;catch&#8230;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = {<span style="color: #E6DB74;">'0'</span>:<span style="color: #E6DB74;">'a'</span>,<span style="color: #E6DB74;">'1'</span>:<span style="color: #E6DB74;">'b'</span>,<span style="color: #E6DB74;">'2'</span>:<span style="color: #E6DB74;">'c'</span>};
<span style="color: #F92672;">try</span> {
Object.keys(obj).forEach(<span style="color: #F92672;">function</span>(<span style="color: #FD971F;">key</span>){
<span style="color: #F92672;">if</span>(key == <span style="color: #E6DB74;">'a'</span>){
console.log(key,obj[key]);
<span style="color: #F92672;">throw</span> <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Error</span>(<span style="color: #E6DB74;">'exist'</span>);
}
});
} <span style="color: #F92672;">catch</span> (ex) {
<span style="color: #F92672;">if</span>(ex.message==<span style="color: #E6DB74;">'exist'</span>) <span style="color: #F92672;">throw</span> ex
} <span style="color: #F92672;">finally</span> { 
console.log(<span style="color: #E6DB74;">'done'</span>);
}
</pre>
</div></li>
<li><p>
for-in
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = {<span style="color: #E6DB74;">'0'</span>:<span style="color: #E6DB74;">'a'</span>,<span style="color: #E6DB74;">'1'</span>:<span style="color: #E6DB74;">'b'</span>,<span style="color: #E6DB74;">'2'</span>:<span style="color: #E6DB74;">'c'</span>};
<span style="color: #F92672;">for</span>(<span style="color: #F92672;">var</span> <span style="color: #FD971F;">i</span> <span style="color: #F92672;">in</span> obj) {
    console.log(i,<span style="color: #E6DB74;">":"</span>,obj[i]);
}
</pre>
</div></li>
<li><p>
for-of
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">// </span><span style="color: #75715E;">&#25903;&#25345;&#25968;&#32452;&#36941;&#21382;&#12289;&#22823;&#22810;&#25968;&#31867;&#25968;&#32452;&#23545;&#35937;&#12289;&#23383;&#31526;&#20018;&#65288;&#35270;&#20026;&#19968;&#31995;&#21015;&#30340;Unicode&#23383;&#31526;&#26469;&#36827;&#34892;&#36941;&#21382;&#65289;</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">arr</span>=[<span style="color: #E6DB74;">"&#24352;&#19977;"</span>,<span style="color: #E6DB74;">"&#26446;&#22235;"</span>,<span style="color: #E6DB74;">"&#29579;&#20116;"</span>,<span style="color: #E6DB74;">"&#36213;&#20845;"</span>];
<span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">value</span> of arr){
    console.log(value);
}
</pre>
</div></li>
<li><p>
使用Object.getOwnPropertyNames(obj) 遍历
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = {<span style="color: #E6DB74;">'0'</span>:<span style="color: #E6DB74;">'a'</span>,<span style="color: #E6DB74;">'1'</span>:<span style="color: #E6DB74;">'b'</span>,<span style="color: #E6DB74;">'2'</span>:<span style="color: #E6DB74;">'c'</span>};
Object.getOwnPropertyNames(obj).forEach(<span style="color: #F92672;">function</span>(<span style="color: #FD971F;">key</span>){
    console.log(key,obj[key]);
});
</pre>
</div></li>
<li><p>
使用Reflect.ownKeys(obj) 遍历
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = {<span style="color: #E6DB74;">'0'</span>:<span style="color: #E6DB74;">'a'</span>,<span style="color: #E6DB74;">'1'</span>:<span style="color: #E6DB74;">'b'</span>,<span style="color: #E6DB74;">'2'</span>:<span style="color: #E6DB74;">'c'</span>};
Reflect.ownKeys(obj).forEach(<span style="color: #F92672;">function</span>(<span style="color: #FD971F;">key</span>){
    console.log(key,obj[key]);
});
</pre>
</div></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgcd693b1" class="outline-2">
<h2 id="orgcd693b1"><span class="section-number-2">6</span> 校验</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org76c4408" class="outline-3">
<h3 id="org76c4408"><span class="section-number-3">6.1</span> 检查对象是否为空对象</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #75715E;">/* </span>
<span style="color: #75715E;"> * &#26816;&#27979;&#23545;&#35937;&#26159;&#21542;&#26159;&#31354;&#23545;&#35937;(&#19981;&#21253;&#21547;&#20219;&#20309;&#21487;&#35835;&#23646;&#24615;)&#12290; //&#22914;&#20320;&#19978;&#38754;&#30340;&#37027;&#20010;&#23545;&#35937;&#23601;&#26159;&#19981;&#21547;&#20219;&#20309;&#21487;&#35835;&#23646;&#24615;</span>
<span style="color: #75715E;"> * &#26041;&#27861;&#21482;&#26082;&#26816;&#27979;&#23545;&#35937;&#26412;&#36523;&#30340;&#23646;&#24615;&#65292;&#19981;&#26816;&#27979;&#20174;&#21407;&#22411;&#32487;&#25215;&#30340;&#23646;&#24615;&#12290; </span>
<span style="color: #75715E;"> */</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">isOwnEmpty</span>(<span style="color: #FD971F;">obj</span>) {
    <span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">name</span> <span style="color: #F92672;">in</span> obj) {
        <span style="color: #F92672;">if</span> (obj.hasOwnProperty(name)) {
            <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">false</span>;
        }
    }
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">true</span>;
}
<span style="color: #75715E;">/* </span>
<span style="color: #75715E;"> * &#26816;&#27979;&#23545;&#35937;&#26159;&#21542;&#26159;&#31354;&#23545;&#35937;(&#19981;&#21253;&#21547;&#20219;&#20309;&#21487;&#35835;&#23646;&#24615;)&#12290; </span>
<span style="color: #75715E;"> * &#26041;&#27861;&#26082;&#26816;&#27979;&#23545;&#35937;&#26412;&#36523;&#30340;&#23646;&#24615;&#65292;&#20063;&#26816;&#27979;&#20174;&#21407;&#22411;&#32487;&#25215;&#30340;&#23646;&#24615;(&#22240;&#27492;&#27809;&#26377;&#20351;hasOwnProperty)&#12290; </span>
<span style="color: #75715E;"> */</span>
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">isEmpty</span>(<span style="color: #FD971F;">obj</span>) {
    <span style="color: #F92672;">for</span> (<span style="color: #F92672;">var</span> <span style="color: #FD971F;">name</span> <span style="color: #F92672;">in</span> obj) {
        <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">false</span>;
    }
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">true</span>;
}
</pre>
</div>
</div>
</div>
