_orgs/_posts/javascript/2015-10-15-apply-javascript.org
** 身份证号校验
   //检验身份证号码
   #+BEGIN_SRC javascript
     function checkIdcard(idcard) {
	 var Msgs = new Array(
	     "验证通过",
	     "校验身份证号码位数不对，请正确输入身份证号码。",
	     "校验出生日期无效，请正确输入真实的身份证号码。",
	     "检验身份证号码错误，请输入真实的身份证号码。",
	     "校验身份证省份错误，请输入真实的身份证号码。",
	     "身份证号码不允许为空，请输入真实的身份证号码。"
	 );

	 idcard = idcard.toUpperCase();
	 var area = { 11: "北京", 12: "天津", 13: "河北", 14: "山西", 15: "内蒙古", 21: "辽宁", 22: "吉林", 23: "黑龙江", 31: "上海", 32: "江苏", 33: "浙江", 34: "安徽", 35: "福建", 36: "江西", 37: "山东", 41: "河南", 42: "湖北", 43: "湖南", 44: "广东", 45: "广西", 46: "海南", 50: "重庆", 51: "四川", 52: "贵州", 53: "云南", 54: "西藏", 61: "陕西", 62: "甘肃", 63: "青海", 64: "宁夏", 65: "新疆", 71: "台湾", 81: "香港", 82: "澳门", 91: "国外" }
	 var idcard, Y, JYM;
	 var S, M;
	 var idcard_array = new Array();
	 idcard_array = idcard.split("");

	 //验证是否为空
	 if (idcard.length <= 0) {
	     return Msgs[5];
	 }

	 //验证号码位数
	 if (idcard.length != 15 && idcard.length != 18) {
	     return Msgs[1];
	 }

	 //地区检验
	 if (area[parseInt(idcard.substr(0, 2))] == null) {
	     return Msgs[4];
	 }


	 //身份号码位数及格式检验
	 switch (idcard.length) {
	 case 15:
	     if ((parseInt(idcard.substr(6, 2)) + 1900) % 4 == 0 || ((parseInt(idcard.substr(6, 2)) + 1900) % 100 == 0 && (parseInt(idcard.substr(6, 2)) + 1900) % 4 == 0)) {
		 ereg = /^[1-9][0-9]{5}[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}$/;//测试出生日期的合法性
	     } else {
		 ereg = /^[1-9][0-9]{5}[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}$/;//测试出生日期的合法性
	     }
	     if (ereg.test(idcard))
		 return Msgs[0];
	     else {
		 return Msgs[3];
	     }
	     break;
	 case 18:
	     //18位身份号码检测
	     //出生日期的合法性检查 
	     //闰年月日:((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))
	     //平年月日:((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))
	     if (parseInt(idcard.substr(6, 4)) % 4 == 0 || (parseInt(idcard.substr(6, 4)) % 100 == 0 && parseInt(idcard.substr(6, 4)) % 4 == 0)) {
		 ereg = /^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}[0-9Xx]$/;//闰年出生日期的合法性正则表达式
	     } else {
		 ereg = /^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}[0-9Xx]$/;//平年出生日期的合法性正则表达式
	     }
	     if (ereg.test(idcard)) {//测试出生日期的合法性
		 //计算校验位
		 S = (parseInt(idcard_array[0]) + parseInt(idcard_array[10])) * 7
		     + (parseInt(idcard_array[1]) + parseInt(idcard_array[11])) * 9
		     + (parseInt(idcard_array[2]) + parseInt(idcard_array[12])) * 10
		     + (parseInt(idcard_array[3]) + parseInt(idcard_array[13])) * 5
		     + (parseInt(idcard_array[4]) + parseInt(idcard_array[14])) * 8
		     + (parseInt(idcard_array[5]) + parseInt(idcard_array[15])) * 4
		     + (parseInt(idcard_array[6]) + parseInt(idcard_array[16])) * 2
		     + parseInt(idcard_array[7]) * 1
		     + parseInt(idcard_array[8]) * 6
		     + parseInt(idcard_array[9]) * 3;
		 Y = S % 11;
		 M = "F";
		 JYM = "10X98765432";
		 M = JYM.substr(Y, 1);//判断校验位
		 if (M == idcard_array[17])
		     return Msgs[0];
		 else {
		     return Msgs[3];
		 }
	     }
	     else {
		 return Msgs[2];
	     }
	     break;
	 default:
	     return Msgs[1];
	     break;
	 }
     }
   #+END_SRC

   //身份证号码验证算法
   #+BEGIN_SRC javascript
     //--根据17位数字本体码获取最后一位校验码程序
     public class Id18 {
	 int[] weight={7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};    //十七位数字本体码权重
	 char[] validate={ '1','0','X','9','8','7','6','5','4','3','2'};    //mod11,对应校验码字符值    
    
	 public char getValidateCode(String id17){
	     int sum = 0;
	     int mode = 0;
	     for(int i = 0; i < id17.length(); i++){
		 sum=sum+Integer.parseInt(String.valueOf(id17.charAt(i)))*weight[i];
	     }
	     mode = sum % 11;
	     return validate[mode];
	 }
    
	 public static void main(String[] args){
	     Id18 tes t= new Id18();
	     System.out.println("该身份证验证码："+test.getValidateCode("14230219700101101"));    //该身份证校验码：3
	 }
     }
   #+END_SRC
   *公民身份号码是特征组合码，由十七位数字本体码和一位校验码组成。*
   \\
   排列顺序从左至右依次为：六位数字地址码，八位数字出生日期码，三位数字顺序码和一位校验码。
   \\ 
   1. 地址码
      \\
      表示编码对象常住户口所在县(市、旗、区)的行政区域划分代码，按GB/T2260的规定执行。
   2. 出生日期码
      \\
      表示编码对象出生的年、月、日，按GB/T7408的规定执行，年、月、日代码之间不用分隔符。
   3. 顺序码
      \\
      表示在同一地址码所标识的区域范围内，对同年、同月、同日出生的人编定的顺序号，顺序码的奇数分配给男性，偶数分配给女性。
   4. 校验码计算步骤
      \\
      (1)十七位数字本体码加权求和公式
      \\
      S = Sum(Ai * Wi), i = 0, … , 16 ，先对前 17 位数字的权求和
      \\
      Ai：表示第i位置上的身份证号码数字值(0~9)
      \\
      Wi：7 9 10 5 8 4 2 1 6 3 7 9 10 5 8 4 2 （表示第 i 位置上的加权因子）
      \\
      (2)计算模
      \\
      Y = mod(S, 11)
      \\
      (3)根据模，查找得到对应的校验码
      \\
      Y: 0 1 2 3 4 5 6 7 8 9 10
      \\
      校验码: 1 0 X 9 8 7 6 5 4 3 2
      \\
   5. 说明：
      - 程序可以根据已有的17位数字本体码，获取对应的验证码。
      - 该程序可以剔除验证码不正确的身份证号码。
      - 15位的身份证出生年份采用年份后2位，没有最后1位校验码。
      - 完整的身份证18位，最后一位校验位可能是非数字。我们的一个项目，数据库保存前17位数字，这样对应一些SQL语句（比如inner join）有加速作用的！！！
