_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-orgf564316" class="outline-3">
<h3 id="orgf564316"><span class="section-number-3">6.2</span> 身份证号校验</h3>
<div class="outline-text-3" id="text-6-2">
<p>
//检验身份证号码
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">checkIdcard</span>(<span style="color: #FD971F;">idcard</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">Msgs</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Array</span>(
        <span style="color: #E6DB74;">"&#39564;&#35777;&#36890;&#36807;"</span>,
        <span style="color: #E6DB74;">"&#26657;&#39564;&#36523;&#20221;&#35777;&#21495;&#30721;&#20301;&#25968;&#19981;&#23545;&#65292;&#35831;&#27491;&#30830;&#36755;&#20837;&#36523;&#20221;&#35777;&#21495;&#30721;&#12290;"</span>,
        <span style="color: #E6DB74;">"&#26657;&#39564;&#20986;&#29983;&#26085;&#26399;&#26080;&#25928;&#65292;&#35831;&#27491;&#30830;&#36755;&#20837;&#30495;&#23454;&#30340;&#36523;&#20221;&#35777;&#21495;&#30721;&#12290;"</span>,
        <span style="color: #E6DB74;">"&#26816;&#39564;&#36523;&#20221;&#35777;&#21495;&#30721;&#38169;&#35823;&#65292;&#35831;&#36755;&#20837;&#30495;&#23454;&#30340;&#36523;&#20221;&#35777;&#21495;&#30721;&#12290;"</span>,
        <span style="color: #E6DB74;">"&#26657;&#39564;&#36523;&#20221;&#35777;&#30465;&#20221;&#38169;&#35823;&#65292;&#35831;&#36755;&#20837;&#30495;&#23454;&#30340;&#36523;&#20221;&#35777;&#21495;&#30721;&#12290;"</span>,
        <span style="color: #E6DB74;">"&#36523;&#20221;&#35777;&#21495;&#30721;&#19981;&#20801;&#35768;&#20026;&#31354;&#65292;&#35831;&#36755;&#20837;&#30495;&#23454;&#30340;&#36523;&#20221;&#35777;&#21495;&#30721;&#12290;"</span>
    );

    idcard = idcard.toUpperCase();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">area</span> = { 11: <span style="color: #E6DB74;">"&#21271;&#20140;"</span>, 12: <span style="color: #E6DB74;">"&#22825;&#27941;"</span>, 13: <span style="color: #E6DB74;">"&#27827;&#21271;"</span>, 14: <span style="color: #E6DB74;">"&#23665;&#35199;"</span>, 15: <span style="color: #E6DB74;">"&#20869;&#33945;&#21476;"</span>, 21: <span style="color: #E6DB74;">"&#36797;&#23425;"</span>, 22: <span style="color: #E6DB74;">"&#21513;&#26519;"</span>, 23: <span style="color: #E6DB74;">"&#40657;&#40857;&#27743;"</span>, 31: <span style="color: #E6DB74;">"&#19978;&#28023;"</span>, 32: <span style="color: #E6DB74;">"&#27743;&#33487;"</span>, 33: <span style="color: #E6DB74;">"&#27993;&#27743;"</span>, 34: <span style="color: #E6DB74;">"&#23433;&#24509;"</span>, 35: <span style="color: #E6DB74;">"&#31119;&#24314;"</span>, 36: <span style="color: #E6DB74;">"&#27743;&#35199;"</span>, 37: <span style="color: #E6DB74;">"&#23665;&#19996;"</span>, 41: <span style="color: #E6DB74;">"&#27827;&#21335;"</span>, 42: <span style="color: #E6DB74;">"&#28246;&#21271;"</span>, 43: <span style="color: #E6DB74;">"&#28246;&#21335;"</span>, 44: <span style="color: #E6DB74;">"&#24191;&#19996;"</span>, 45: <span style="color: #E6DB74;">"&#24191;&#35199;"</span>, 46: <span style="color: #E6DB74;">"&#28023;&#21335;"</span>, 50: <span style="color: #E6DB74;">"&#37325;&#24198;"</span>, 51: <span style="color: #E6DB74;">"&#22235;&#24029;"</span>, 52: <span style="color: #E6DB74;">"&#36149;&#24030;"</span>, 53: <span style="color: #E6DB74;">"&#20113;&#21335;"</span>, 54: <span style="color: #E6DB74;">"&#35199;&#34255;"</span>, 61: <span style="color: #E6DB74;">"&#38485;&#35199;"</span>, 62: <span style="color: #E6DB74;">"&#29976;&#32899;"</span>, 63: <span style="color: #E6DB74;">"&#38738;&#28023;"</span>, 64: <span style="color: #E6DB74;">"&#23425;&#22799;"</span>, 65: <span style="color: #E6DB74;">"&#26032;&#30086;"</span>, 71: <span style="color: #E6DB74;">"&#21488;&#28286;"</span>, 81: <span style="color: #E6DB74;">"&#39321;&#28207;"</span>, 82: <span style="color: #E6DB74;">"&#28595;&#38376;"</span>, 91: <span style="color: #E6DB74;">"&#22269;&#22806;"</span> }
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">idcard</span>, <span style="color: #FD971F;">Y</span>, <span style="color: #FD971F;">JYM</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">S</span>, <span style="color: #FD971F;">M</span>;
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">idcard_array</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Array</span>();
    idcard_array = idcard.split(<span style="color: #E6DB74;">""</span>);

    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#39564;&#35777;&#26159;&#21542;&#20026;&#31354;</span>
    <span style="color: #F92672;">if</span> (idcard.length &lt;= 0) {
        <span style="color: #F92672;">return</span> Msgs[5];
    }

    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#39564;&#35777;&#21495;&#30721;&#20301;&#25968;</span>
    <span style="color: #F92672;">if</span> (idcard.length != 15 &amp;&amp; idcard.length != 18) {
        <span style="color: #F92672;">return</span> Msgs[1];
    }

    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#22320;&#21306;&#26816;&#39564;</span>
    <span style="color: #F92672;">if</span> (area[parseInt(idcard.substr(0, 2))] == <span style="color: #AE81FF;">null</span>) {
        <span style="color: #F92672;">return</span> Msgs[4];
    }


    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#36523;&#20221;&#21495;&#30721;&#20301;&#25968;&#21450;&#26684;&#24335;&#26816;&#39564;</span>
    <span style="color: #F92672;">switch</span> (idcard.length) {
    <span style="color: #F92672;">case</span> 15:
        <span style="color: #F92672;">if</span> ((parseInt(idcard.substr(6, 2)) + 1900) % 4 == 0 || ((parseInt(idcard.substr(6, 2)) + 1900) % 100 == 0 &amp;&amp; (parseInt(idcard.substr(6, 2)) + 1900) % 4 == 0)) {
            ereg = <span style="color: #E6DB74;">/^[1-9][0-9]{5}[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}$/</span>;<span style="color: #75715E;">//</span><span style="color: #75715E;">&#27979;&#35797;&#20986;&#29983;&#26085;&#26399;&#30340;&#21512;&#27861;&#24615;</span>
        } <span style="color: #F92672;">else</span> {
            ereg = <span style="color: #E6DB74;">/^[1-9][0-9]{5}[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}$/</span>;<span style="color: #75715E;">//</span><span style="color: #75715E;">&#27979;&#35797;&#20986;&#29983;&#26085;&#26399;&#30340;&#21512;&#27861;&#24615;</span>
        }
        <span style="color: #F92672;">if</span> (ereg.test(idcard))
            <span style="color: #F92672;">return</span> Msgs[0];
        <span style="color: #F92672;">else</span> {
            <span style="color: #F92672;">return</span> Msgs[3];
        }
        <span style="color: #F92672;">break</span>;
    <span style="color: #F92672;">case</span> 18:
        <span style="color: #75715E;">//</span><span style="color: #75715E;">18&#20301;&#36523;&#20221;&#21495;&#30721;&#26816;&#27979;</span>
        <span style="color: #75715E;">//</span><span style="color: #75715E;">&#20986;&#29983;&#26085;&#26399;&#30340;&#21512;&#27861;&#24615;&#26816;&#26597; </span>
        <span style="color: #75715E;">//</span><span style="color: #75715E;">&#38384;&#24180;&#26376;&#26085;:((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))</span>
        <span style="color: #75715E;">//</span><span style="color: #75715E;">&#24179;&#24180;&#26376;&#26085;:((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))</span>
        <span style="color: #F92672;">if</span> (parseInt(idcard.substr(6, 4)) % 4 == 0 || (parseInt(idcard.substr(6, 4)) % 100 == 0 &amp;&amp; parseInt(idcard.substr(6, 4)) % 4 == 0)) {
            ereg = <span style="color: #E6DB74;">/^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}[0-9Xx]$/</span>;<span style="color: #75715E;">//</span><span style="color: #75715E;">&#38384;&#24180;&#20986;&#29983;&#26085;&#26399;&#30340;&#21512;&#27861;&#24615;&#27491;&#21017;&#34920;&#36798;&#24335;</span>
        } <span style="color: #F92672;">else</span> {
            ereg = <span style="color: #E6DB74;">/^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}[0-9Xx]$/</span>;<span style="color: #75715E;">//</span><span style="color: #75715E;">&#24179;&#24180;&#20986;&#29983;&#26085;&#26399;&#30340;&#21512;&#27861;&#24615;&#27491;&#21017;&#34920;&#36798;&#24335;</span>
        }
        <span style="color: #F92672;">if</span> (ereg.test(idcard)) {<span style="color: #75715E;">//</span><span style="color: #75715E;">&#27979;&#35797;&#20986;&#29983;&#26085;&#26399;&#30340;&#21512;&#27861;&#24615;</span>
            <span style="color: #75715E;">//</span><span style="color: #75715E;">&#35745;&#31639;&#26657;&#39564;&#20301;</span>
            S = (parseInt(idcard_array[0]) + parseInt(idcard_array[10])) * 7
                + (parseInt(idcard_array[1]) + parseInt(idcard_array[11])) * 9
                + (parseInt(idcard_array[2]) + parseInt(idcard_array[12])) * 10
                + (parseInt(idcard_array[3]) + parseInt(idcard_array[13])) * 5
                + (parseInt(idcard_array[4]) + parseInt(idcard_array[14])) * 8
                + (parseInt(idcard_array[5]) + parseInt(idcard_array[15])) * 4
                + (parseInt(idcard_array[6]) + parseInt(idcard_array[16])) * 2
                + parseInt(idcard_array[7]) * 1
                + parseInt(idcard_array[8]) * 6
                + parseInt(idcard_array[9]) * 3;
            Y = S % 11;
            M = <span style="color: #E6DB74;">"F"</span>;
            JYM = <span style="color: #E6DB74;">"10X98765432"</span>;
            M = JYM.substr(Y, 1);<span style="color: #75715E;">//</span><span style="color: #75715E;">&#21028;&#26029;&#26657;&#39564;&#20301;</span>
            <span style="color: #F92672;">if</span> (M == idcard_array[17])
                <span style="color: #F92672;">return</span> Msgs[0];
            <span style="color: #F92672;">else</span> {
                <span style="color: #F92672;">return</span> Msgs[3];
            }
        }
        <span style="color: #F92672;">else</span> {
            <span style="color: #F92672;">return</span> Msgs[2];
        }
        <span style="color: #F92672;">break</span>;
    <span style="color: #F92672;">default</span>:
        <span style="color: #F92672;">return</span> Msgs[1];
        <span style="color: #F92672;">break</span>;
    }
}
</pre>
</div>

<p>
//身份证号码验证算法
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #75715E;">//</span><span style="color: #75715E;">--&#26681;&#25454;17&#20301;&#25968;&#23383;&#26412;&#20307;&#30721;&#33719;&#21462;&#26368;&#21518;&#19968;&#20301;&#26657;&#39564;&#30721;&#31243;&#24207;</span>
<span style="color: #F92672;">public</span> <span style="color: #F92672;">class</span> Id18 {
    <span style="color: #66D9EF;">int</span>[] weight={7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#21313;&#19971;&#20301;&#25968;&#23383;&#26412;&#20307;&#30721;&#26435;&#37325;</span>
    <span style="color: #66D9EF;">char</span>[] validate={ <span style="color: #E6DB74;">'1'</span>,<span style="color: #E6DB74;">'0'</span>,<span style="color: #E6DB74;">'X'</span>,<span style="color: #E6DB74;">'9'</span>,<span style="color: #E6DB74;">'8'</span>,<span style="color: #E6DB74;">'7'</span>,<span style="color: #E6DB74;">'6'</span>,<span style="color: #E6DB74;">'5'</span>,<span style="color: #E6DB74;">'4'</span>,<span style="color: #E6DB74;">'3'</span>,<span style="color: #E6DB74;">'2'</span>};    <span style="color: #75715E;">//</span><span style="color: #75715E;">mod11,&#23545;&#24212;&#26657;&#39564;&#30721;&#23383;&#31526;&#20540;    </span>

    <span style="color: #F92672;">public</span> <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">getValidateCode</span>(String id17){
        <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">sum</span> = 0;
        <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">mode</span> = 0;
        <span style="color: #F92672;">for</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = 0; i &lt; id17.length(); i++){
            sum=sum+Integer.parseInt(String.valueOf(id17.charAt(i)))*weight[i];
        }
        mode = sum % 11;
        <span style="color: #F92672;">return</span> validate[mode];
    }

    <span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #F92672;">void</span> <span style="color: #FD971F;">main</span>(String[] args){
        Id18 tes t= <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Id18</span>();
        System.out.println(<span style="color: #E6DB74;">"&#35813;&#36523;&#20221;&#35777;&#39564;&#35777;&#30721;&#65306;"</span>+test.getValidateCode(<span style="color: #E6DB74;">"14230219700101101"</span>));    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#35813;&#36523;&#20221;&#35777;&#26657;&#39564;&#30721;&#65306;3</span>
    }
}
</pre>
</div>
<p>
<b>公民身份号码是特征组合码，由十七位数字本体码和一位校验码组成。</b>
<br />
排列顺序从左至右依次为：六位数字地址码，八位数字出生日期码，三位数字顺序码和一位校验码。
<br />
</p>
<ol class="org-ol">
<li>地址码
<br />
表示编码对象常住户口所在县(市、旗、区)的行政区域划分代码，按GB/T2260的规定执行。</li>
<li>出生日期码
<br />
表示编码对象出生的年、月、日，按GB/T7408的规定执行，年、月、日代码之间不用分隔符。</li>
<li>顺序码
<br />
表示在同一地址码所标识的区域范围内，对同年、同月、同日出生的人编定的顺序号，顺序码的奇数分配给男性，偶数分配给女性。</li>
<li>校验码计算步骤
<br />
(1)十七位数字本体码加权求和公式
<br />
S = Sum(Ai * Wi), i = 0, … , 16 ，先对前 17 位数字的权求和
<br />
Ai：表示第i位置上的身份证号码数字值(0~9)
<br />
Wi：7 9 10 5 8 4 2 1 6 3 7 9 10 5 8 4 2 （表示第 i 位置上的加权因子）
<br />
(2)计算模
<br />
Y = mod(S, 11)
<br />
(3)根据模，查找得到对应的校验码
<br />
Y: 0 1 2 3 4 5 6 7 8 9 10
<br />
校验码: 1 0 X 9 8 7 6 5 4 3 2
<br /></li>
<li>说明：
<ul class="org-ul">
<li>程序可以根据已有的17位数字本体码，获取对应的验证码。</li>
<li>该程序可以剔除验证码不正确的身份证号码。</li>
<li>15位的身份证出生年份采用年份后2位，没有最后1位校验码。</li>
<li>完整的身份证18位，最后一位校验位可能是非数字。我们的一个项目，数据库保存前17位数字，这样对应一些SQL语句（比如inner join）有加速作用的！！！</li>
</ul></li>
</ol>
</div>
</div>
