_orgs/_posts/javascript/2015-10-15-apply-javascript.org
** 电话号码校验
   #+BEGIN_SRC javascript

   #+END_SRC
** Email校验
   #+BEGIN_SRC javascript

   #+END_SRC
** IP地址校验
   #+BEGIN_SRC javascript

   #+END_SRC
** 其他校验
*** 检查QQ号码
    #+BEGIN_SRC javascript
      function checkqq()  //检查QQ号码                                                                                                                      
      {                                                                                                                                                     
	  var qq=document.getElementById("qq").value;                                                                                                   
	  var divqq=document.getElementById("qq");                                                                                                      
	  if(qq!="")                                                                                                                                    
	  {                                                                                                                                             
	      if(qq.match(/\D/)!=null)                                                                                                              
	      {                                                                                                                                     
		  divqq.innerHTML="<font color='red'>QQ号码只能输入数字！</font>";                                                              
		  return false;                                                                                                                 
	      }                                                                                                                                     
	      else                                                                                                                                  
	      {                                                                                                                                    
		  divqq.innerHTML="<font color='red'>√</font>";                                                                                
		  return true;                                                                                                                  
	      }                                                                                                                                     
	  }                                                                                                                                             
	  else                                                                                                                                          
	  {                                                                                                                                            
	      divqq.innerHTML="<font color='green'>√</font>";                                                                                      
	      return true;                                                                                                                          
	  }                                                                                                                                             
      }                                                                                                                                                     
    #+END_SRC
* 其他
** 滚动到页面顶部
   #+BEGIN_SRC javascript
     function goTopEx() {
	 var obj = document.getElementById("goTopBtn");
	 function getScrollTop() {
	     return document.documentElement.scrollTop;
	 }
	 function setScrollTop(value) {
	     document.documentElement.scrollTop = value;
	 }
	 window.onscroll = function () { getScrollTop() > 0 ? obj.style.display = "" : obj.style.display = "none"; }
	 obj.onclick = function () {
	     var goTop = setInterval(scrollMove, 10);
	     function scrollMove() {
		 setScrollTop(getScrollTop() / 1.1);
		 if (getScrollTop() < 1) clearInterval(goTop);
	     }
	 }
     }
   #+END_SRC
* 页面操作
** 根据网页实际大小来设置iframe显示区域大小
   #+BEGIN_SRC javascript
     $('#iframe_i').load(function () {
	 // “ref_page”为引用页面DIV的ID，获取DIV的外部宽度、外部高度。
	 var width = $(this).contents().find('#ref_page').outerWidth();
	 var height = $(this).contents().find('#ref_page').outerHeight();
	 // 设置iframe的宽度、高度。
	 $(this).width(width);
	 $(this).height(height);
     )};
   #+END_SRC
