_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-org01da854" class="outline-3">
<h3 id="org01da854"><span class="section-number-3">6.3</span> 电话号码校验</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-javascript">
</pre>
</div>
</div>
</div>
<div id="outline-container-orge3a2878" class="outline-3">
<h3 id="orge3a2878"><span class="section-number-3">6.4</span> Email校验</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-javascript">
</pre>
</div>
</div>
</div>
<div id="outline-container-orgce5d82f" class="outline-3">
<h3 id="orgce5d82f"><span class="section-number-3">6.5</span> IP地址校验</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-javascript">
</pre>
</div>
</div>
</div>
<div id="outline-container-org991d75c" class="outline-3">
<h3 id="org991d75c"><span class="section-number-3">6.6</span> 其他校验</h3>
<div class="outline-text-3" id="text-6-6">
</div>
<div id="outline-container-org910137c" class="outline-4">
<h4 id="org910137c"><span class="section-number-4">6.6.1</span> 检查QQ号码</h4>
<div class="outline-text-4" id="text-6-6-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">checkqq</span>()  <span style="color: #75715E;">//</span><span style="color: #75715E;">&#26816;&#26597;QQ&#21495;&#30721;                                                                                                                      </span>
{                                                                                                                                                     
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">qq</span>=document.getElementById(<span style="color: #E6DB74;">"qq"</span>).value;                                                                                                   
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">divqq</span>=document.getElementById(<span style="color: #E6DB74;">"qq"</span>);                                                                                                      
    <span style="color: #F92672;">if</span>(qq!=<span style="color: #E6DB74;">""</span>)                                                                                                                                    
    {                                                                                                                                             
        <span style="color: #F92672;">if</span>(qq.match(<span style="color: #E6DB74;">/\D/</span>)!=<span style="color: #AE81FF;">null</span>)                                                                                                              
        {                                                                                                                                     
            divqq.innerHTML=<span style="color: #E6DB74;">"&lt;font color='red'&gt;QQ&#21495;&#30721;&#21482;&#33021;&#36755;&#20837;&#25968;&#23383;&#65281;&lt;/font&gt;"</span>;                                                              
            <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">false</span>;                                                                                                                 
        }                                                                                                                                     
        <span style="color: #F92672;">else</span>                                                                                                                                  
        {                                                                                                                                    
            divqq.innerHTML=<span style="color: #E6DB74;">"&lt;font color='red'&gt;&#8730;&lt;/font&gt;"</span>;                                                                                
            <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">true</span>;                                                                                                                  
        }                                                                                                                                     
    }                                                                                                                                             
    <span style="color: #F92672;">else</span>                                                                                                                                          
    {                                                                                                                                            
        divqq.innerHTML=<span style="color: #E6DB74;">"&lt;font color='green'&gt;&#8730;&lt;/font&gt;"</span>;                                                                                      
        <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">true</span>;                                                                                                                          
    }                                                                                                                                             
}                                                                                                                                                     
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org5058ab8" class="outline-2">
<h2 id="org5058ab8"><span class="section-number-2">7</span> 其他</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgbd3d3ec" class="outline-3">
<h3 id="orgbd3d3ec"><span class="section-number-3">7.1</span> 滚动到页面顶部</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">goTopEx</span>() {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = document.getElementById(<span style="color: #E6DB74;">"goTopBtn"</span>);
    <span style="color: #F92672;">function</span> <span style="color: #A6E22E;">getScrollTop</span>() {
        <span style="color: #F92672;">return</span> document.documentElement.scrollTop;
    }
    <span style="color: #F92672;">function</span> <span style="color: #A6E22E;">setScrollTop</span>(<span style="color: #FD971F;">value</span>) {
        document.documentElement.scrollTop = value;
    }
    window.onscroll = <span style="color: #F92672;">function</span> () { getScrollTop() &gt; 0 ? obj.style.display = <span style="color: #E6DB74;">""</span> : obj.style.display = <span style="color: #E6DB74;">"none"</span>; }
    obj.onclick = <span style="color: #F92672;">function</span> () {
        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">goTop</span> = setInterval(scrollMove, 10);
        <span style="color: #F92672;">function</span> <span style="color: #A6E22E;">scrollMove</span>() {
            setScrollTop(getScrollTop() / 1.1);
            <span style="color: #F92672;">if</span> (getScrollTop() &lt; 1) clearInterval(goTop);
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb42ed81" class="outline-2">
<h2 id="orgb42ed81"><span class="section-number-2">8</span> 页面操作</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgff37f42" class="outline-3">
<h3 id="orgff37f42"><span class="section-number-3">8.1</span> 根据网页实际大小来设置iframe显示区域大小</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-javascript">$(<span style="color: #E6DB74;">'#iframe_i'</span>).load(<span style="color: #F92672;">function</span> () {
    <span style="color: #75715E;">// </span><span style="color: #75715E;">&#8220;ref_page&#8221;&#20026;&#24341;&#29992;&#39029;&#38754;DIV&#30340;ID&#65292;&#33719;&#21462;DIV&#30340;&#22806;&#37096;&#23485;&#24230;&#12289;&#22806;&#37096;&#39640;&#24230;&#12290;</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">width</span> = $(<span style="color: #AE81FF;">this</span>).contents().find(<span style="color: #E6DB74;">'#ref_page'</span>).outerWidth();
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">height</span> = $(<span style="color: #AE81FF;">this</span>).contents().find(<span style="color: #E6DB74;">'#ref_page'</span>).outerHeight();
    <span style="color: #75715E;">// </span><span style="color: #75715E;">&#35774;&#32622;iframe&#30340;&#23485;&#24230;&#12289;&#39640;&#24230;&#12290;</span>
    $(<span style="color: #AE81FF;">this</span>).width(width);
    $(<span style="color: #AE81FF;">this</span>).height(height);
)};
</pre>
</div>
</div>
</div>
