_orgs/_posts/javascript/2015-10-15-apply-javascript.org
** 动态显示收缩列表
   #+NAME: Method 1:
   #+BEGIN_SRC javascript
     $(document).ready(function(){
	 //当点击某一列表项时，滑出下级菜单并收起其他列表项
	 $("#user_manage").click(function(){
	     // $("#user_about").fadeToggle();
	     $("#user_manage").addClass("active");
	     $("#node_manage").removeClass("active");
	     $("#role_manage").removeClass("active");
	     $("#setting").removeClass("active");
	     $("#user_about").slideToggle();
	     $("#node_about").slideUp();
	     $("#role_about").slideUp();
	     /*$("#div2").fadeToggle("slow");
	       $("#div3").fadeToggle(3000);*/
	 });
     });
   #+END_SRC                                                                                                                                             

   #+NAME:Method 2:
   #+BEGIN_SRC javascript
     https://jqueryui.com/accordion/
   #+END_SRC
* 注意事项
*** JavaScript没有块级作用域
    在其他类C的语言中，由 {} 封闭的代码块都有自己的作用域（如果用ECMAScript的话来讲，就是它们自己的执行环境）。
    #+BEGIN_SRC javascript
      if(true){
	  var color="blue";
      }
      alert(color); //"blue"
    #+END_SRC
    内容源于：《JavaScript高级程序设计》第3版 [美] Nicholas C.Zakas，p76.
