_posts/javascript/2015-10-15-apply-javascript.html
<div id="outline-container-org2f85f8e" class="outline-3">
<h3 id="org2f85f8e"><span class="section-number-3">8.2</span> 动态显示收缩列表</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-javascript" id="orga24bdea">$(document).ready(<span style="color: #F92672;">function</span>(){
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#24403;&#28857;&#20987;&#26576;&#19968;&#21015;&#34920;&#39033;&#26102;&#65292;&#28369;&#20986;&#19979;&#32423;&#33756;&#21333;&#24182;&#25910;&#36215;&#20854;&#20182;&#21015;&#34920;&#39033;</span>
    $(<span style="color: #E6DB74;">"#user_manage"</span>).click(<span style="color: #F92672;">function</span>(){
        <span style="color: #75715E;">// </span><span style="color: #75715E;">$("#user_about").fadeToggle();</span>
        $(<span style="color: #E6DB74;">"#user_manage"</span>).addClass(<span style="color: #E6DB74;">"active"</span>);
        $(<span style="color: #E6DB74;">"#node_manage"</span>).removeClass(<span style="color: #E6DB74;">"active"</span>);
        $(<span style="color: #E6DB74;">"#role_manage"</span>).removeClass(<span style="color: #E6DB74;">"active"</span>);
        $(<span style="color: #E6DB74;">"#setting"</span>).removeClass(<span style="color: #E6DB74;">"active"</span>);
        $(<span style="color: #E6DB74;">"#user_about"</span>).slideToggle();
        $(<span style="color: #E6DB74;">"#node_about"</span>).slideUp();
        $(<span style="color: #E6DB74;">"#role_about"</span>).slideUp();
        <span style="color: #75715E;">/*</span><span style="color: #75715E;">$("#div2").fadeToggle("slow");</span>
<span style="color: #75715E;">          $("#div3").fadeToggle(3000);*/</span>
    });
});
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript" id="orge9a573d">https:<span style="color: #75715E;">//</span><span style="color: #75715E;">jqueryui.com/accordion/</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org38caf56" class="outline-2">
<h2 id="org38caf56"><span class="section-number-2">9</span> 注意事项</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org2284d12" class="outline-4">
<h4 id="org2284d12"><span class="section-number-4">9.0.1</span> JavaScript没有块级作用域</h4>
<div class="outline-text-4" id="text-9-0-1">
<p>
在其他类C的语言中，由 {} 封闭的代码块都有自己的作用域（如果用ECMAScript的话来讲，就是它们自己的执行环境）。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F92672;">if</span>(<span style="color: #AE81FF;">true</span>){
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">color</span>=<span style="color: #E6DB74;">"blue"</span>;
}
alert(color); <span style="color: #75715E;">//</span><span style="color: #75715E;">"blue"</span>
</pre>
</div>
<p>
内容源于：《JavaScript高级程序设计》第3版 [美] Nicholas C.Zakas，p76.
</p>
</div>
</div>
</div>
